{
    "TakeTwo": [
      {
        "year": 2002,
        "headline": "State of Emergency Sparks Controversy",
        "body": "Take-Two released \"State of Emergency\" for PlayStation 2, a game that stirred debate due to its violent content. Despite the controversy, it achieved commercial success, bolstering Take-Two’s portfolio. Take-Two also increased its financial guidance for fiscal 2002 to $733 million in net sales and $1.68 of diluted net income per share, driven by strong sales of its published products."
      },
      {
        "year": 2003,
        "headline": "Financial Restatements and Stock Buyback",
        "body": "Take-Two’s revenues exceeded $1 billion, marking a significant financial achievement. The company also introduced the Gotham Games label to diversify its publishing strategy, restated its financial statements for fiscal 1999–2002 to reflect a revised revenue recognition policy, and announced a $25 million stock repurchase program."
      },
      {
        "year": 2004,
        "headline": "Leadership Changes Amid Financial Challenges",
        "body": "CEO Jeff Lapin resigned and the company faced financial setbacks attributed to underperforming older titles. Net sales for the quarter ended January 31, 2004, were $375.5 million, down from $411.0 million the previous year."
      },
      {
        "year": 2005,
        "headline": "Hot Coffee Mod Leads to ESRB Re-rating",
        "body": "The discovery of hidden content in \"GTA: San Andreas\" led to an ESRB rating change to Adults Only, prompting discussions on content regulation and modding. For the six months ended April 30, 2005, net sales rose 37% to $724.5 million year-over-year, but the company reported a net loss of $8.2 million for the quarter."
      },
      {
        "year": 2006,
        "headline": "Controversial Game Canceled Post-Ratings Issues",
        "body": "Following prior controversies, Take-Two canceled a game to avoid further conflicts with rating boards, adopting a more cautious content approach. Fiscal 2006 net revenue was $1.038 billion (down from $1.201 billion in 2005), with a net loss of $184.9 million or $2.60 per share."
      },
      {
        "year": 2007,
        "headline": "Former CEO Settles with SEC Over Backdating Scandal",
        "body": "Former CEO Ryan Brant settled with the SEC for $6.3 million over stock-option backdating charges, highlighting corporate governance issues. Analysts also predict a financial crisis soon. This might be a good time to sell."
      },
      {
        "year": 2008,
        "headline": "Take-Two Rejects EA’s $2 Billion Acquisition Offer",
        "body": "Electronic Arts’ unsolicited $2 billion bid was declined by Take-Two, which felt it undervalued the company on the eve of \"GTA IV.\" Take-Two reported record Q3 results with non-GAAP EPS of $0.93, and was only mildly affected by the 2008 financial crisis."
      },
      {
        "year": 2009,
        "headline": "Financial Adjustments Amid Game Release Delays",
        "body": "Take-Two revised its financial outlook due to delays in major titles like \"BioShock 2,\" anticipating Q4 and fiscal 2009 results below prior guidance because of those postponements."
      },
      {
        "year": 2010,
        "headline": "CEO Ben Feder Steps Down to Pursue Personal Interests",
        "body": "Ben Feder resigned as CEO to travel with family, with Strauss Zelnick remaining Chairman. The company scheduled Q2 results for April 30, 2010, to be reported on June 8, 2010."
      },
      {
        "year": 2011,
        "headline": "Announcement of Grand Theft Auto V",
        "body": "Rockstar Games announced \"GTA V,\" setting the stage for one of the most anticipated releases ever. Fiscal 2011 net revenue grew 49% to $1.14 billion, with non-GAAP EPS up to $1.02."
      },
      {
        "year": 2012,
        "headline": "Diversification with New IPs and Franchise Entries",
        "body": "Take-Two released \"Borderlands 2\" and \"XCOM: Enemy Unknown,\" demonstrating commitment to both new and legacy franchises. It reported Q4 and fiscal 2012 results for the year ended March 31, 2012. GTA V will be released soon, this might be a good time to buy."
      },
      {
        "year": 2013,
        "headline": "Record-Breaking Launch of Grand Theft Auto V",
        "body": "\"GTA V\" drove a 71% quarterly revenue increase, cementing Take-Two’s market position. The company posted strong Q3 fiscal 2013 results and raised the low end of its financial outlook."
      },
      {
        "year": 2014,
        "headline": "Stock Value Rises Nearly 60% Amid Strong Sales",
        "body": "Fueled by continued success of \"GTA V\" and other titles, Take-Two’s stock surged nearly 60%, reflecting robust investor confidence."
      },
      {
        "year": 2015,
        "headline": "Digital Sales Propel Revenue Growth",
        "body": "Digital distribution reached a record $616 million in sales. Take-Two reported fiscal 2015 non-GAAP net revenue of $1.669 billion and non-GAAP net income of $1.98 per diluted share."
      },
      {
        "year": 2016,
        "headline": "Expectations Exceeded with 31% Revenue Growth",
        "body": "Take-Two reported net revenue growth of 31%, and cash & short-term investments rose to $1.270 billion as of March 31, 2016."
      },
      {
        "year": 2017,
        "headline": "Red Dead Redemption 2 Anticipation Builds",
        "body": "The announcement of \"Red Dead Redemption 2\" generated enormous buzz among fans eagerly awaiting the sequel."
      },
      {
        "year": 2018,
        "headline": "Red Dead Redemption 2 Launches to Critical Acclaim",
        "body": "\"Red Dead Redemption 2\" was met with universal praise, further cementing Take-Two’s reputation for high-quality blockbuster titles."
      },
      {
        "year": 2019,
        "headline": "Expansion into Mobile Gaming with New Acquisitions",
        "body": "Take-Two expanded its mobile footprint through strategic acquisitions, diversifying its portfolio into free-to-play and mobile markets. The firms science division speculated a pandemic that might occur next year driving online engagement to record highs. This might be a good time to buy."
      },
      {
        "year": 2020,
        "headline": "Adaptation to Remote Work Amid Global Pandemic",
        "body": "In response to COVID-19, Take-Two transitioned to remote work and saw a 54% jump in digitally delivered GAAP net revenue to $634.7 million (83% of total), driven by GTA Online, NBA 2K20, and RDR2."
      },
      {
        "year": 2021,
        "headline": "Acquisition of Zynga Enhances Mobile Gaming Presence",
        "body": "Take-Two announced plans to acquire Zynga, boosting mobile titles like Words With Friends and Poker. Digitally delivered GAAP net revenue rose 19% to $753.3 million (90% of total)."
      },
      {
        "year": 2022,
        "headline": "Integration of Zynga Operations",
        "body": "Post-acquisition, Take-Two focused on integrating Zynga, emphasizing mobile development and cross-platform synergies. Q4 net bookings grew 8% to $845.8 million year-over-year."
      },
      {
        "year": 2023,
        "headline": "Announcement of Grand Theft Auto VI",
        "body": "Rockstar Games confirmed \"GTA VI,\" generating excitement about the franchise’s future. GAAP net revenue increased 52.6% to $5.35 billion, though net loss per share was $7.03; net bookings were $5.28 billion."
      },
      {
        "year": 2024,
        "headline": "Launch of 'Tales of the Shire' Expands Fantasy genre",
        "body": "Private Division announced \"Tales of the Shire,\" a Lord of the Rings–themed title. Fiscal 2024 concluded with net bookings of $1.35 billion, exceeding guidance."
      }
    ],
    "EA": [
      {
        "year": 2002,
        "headline": "Announcing Sims 2 and Launching Battlefield 1942",
        "body": "EA announced The Sims 2 development and expanded sports titles—even in a slow market, shares rose as investors liked strong sports and Sims earnings. Later, Battlefield 1942 was released, launching EA’s FPS franchise. Despite Enron and Worldcom scandals briefly rocking markets, EA quickly rebounded with a strong full-year performance."
      },
      {
        "year": 2003,
        "headline": "EA Sports’ Monopoly and Sims Bustin’ Out",
        "body": "As the US recovered, consumer spending rose. EA grew its sports lineup (FIFA 2004, Madden NFL 2004, NBA Live 2004), locking in exclusive licenses and monopolizing sports gaming. The Sims: Bustin’ Out hit consoles, and Need for Speed: Underground sold tens of millions. Stock ended the year positively."
      },
      {
        "year": 2004,
        "headline": "Era of Licensing Capital – NFL & Sims 2",
        "body": "In a strong economy, EA secured the exclusive NFL license for Madden and sold over one million Sims 2 copies in its first month (over six million by year-end), making it the top PC game in 2004. Stock rose on the strength of licensing and blockbuster sales."
      },
      {
        "year": 2005,
        "headline": "Mobile Entry & Industry Competition Intensify",
        "body": "Electronics sales boomed and mobile games rose, sparking fierce competition—2K undercut EA in sports. EA paid $680 million for Jamdat Mobile to enter mobile, drawing investor skepticism. Need for Speed: Most Wanted sold over ten million copies; Madden NFL 06 saw mixed reviews. Stock climbed early then fell, finishing negative."
      },
      {
        "year": 2006,
        "headline": "Cross-Platform Pressures and Godfather Delays",
        "body": "Rising dev costs and engine delays forced studio reorganizations. The Godfather underperformed and console optimization varied, while FIFA 07 and Madden NFL 07 held steady but lacked growth. Stock dipped first half, rebounded late, but ended negative."
      },
      {
        "year": 2007,
        "headline": "BioWare & Pandemic Acquisitions, Rock Band Hit",
        "body": "Record industry revenues fueled RPG and narrative revivals. EA bought BioWare & Pandemic for $775 M, adding Mass Effect & Dragon Age IPs. Harmonix’s Rock Band launched the social music genre, and FIFA 08/Madden 08 improvements delivered stable revenues. Stock was flat then slightly positive. However with a financial crisis looming this might be a good time to sell."
      },
      {
        "year": 2008,
        "headline": "Subprime Crisis Hits EA Amid New IP Launches",
        "body": "The financial meltdown led to job cuts and project cancellations. EA released Dead Space & Mirror’s Edge, but lack of blockbuster hits beyond sports left it vulnerable, and stock fell sharply to finish negative."
      },
      {
        "year": 2009,
        "headline": "Studio Closures and Sims 3 Success",
        "body": "Recovery was slow; EA closed Pandemic and cut staff. The Sims 3 became PC’s top‐selling annual title, and Dragon Age: Origins solidified EA’s RPG credentials. Stock nudged up early then held steady, finishing slightly positive."
      },
      {
        "year": 2010,
        "headline": "Digital-First Pivot – Origin Platform Launch",
        "body": "EA launched Origin to shift away from physical releases in response to Steam’s rise. Mass Effect 2 was a hit; FIFA 11/Madden 11 continued sports growth. The new online-pass model drew controversy, and mixed returns saw stock end negative."
      },
      {
        "year": 2011,
        "headline": "Battlefield 3 Blockbuster & Sims Social Boom",
        "body": "Battlefield 3 sold over five million copies in its first week, rivaling COD: MW3. The Sims Social on Facebook reached ten million users, and FIFA 12’s upgraded physics drove profits despite DLC backlash. Stock rose and ended positive."
      },
      {
        "year": 2012,
        "headline": "Mass Effect 3 Backlash and Origin Criticism",
        "body": "Mobile gaming surged, but Mass Effect 3’s controversial ending sparked fan protests. Origin added features but faced performance complaints. SimCity Social on Facebook flamed out quickly; FIFA 13 remained strong. Stock declined to finish negative."
      },
      {
        "year": 2013,
        "headline": "Leadership Change & Digital-Service Focus",
        "body": "CEO John Riccitiello resigned, Andrew Wilson took over, and EA restructured around “big & precise” digital-service projects. Battlefield 4 launched bug-ridden, but FIFA 14 thrived and Plants vs. Zombies 2 hit mobile, driving investor confidence and a positive stock finish."
      },
      {
        "year": 2014,
        "headline": "Subscription Models Surge with EA Access",
        "body": "Digital adoption accelerated; EA Access subscription service launched to acclaim. Origin was overhauled for cross-platform accounts. The Sims 4 sold well despite content cuts; Dragon Age: Inquisition won GOTY; FIFA 15/Madden 15 remained steady. Stock rose on successful subscriptions."
      },
      {
        "year": 2015,
        "headline": "Star Wars Battlefront and Mobile Revenue Growth",
        "body": "Mobile revenues overtook consoles; EA’s subscription model matured. Star Wars Battlefront sold over ten million copies in its first month on the IP’s popularity. FIFA 16’s women’s teams were praised; Need for Speed’s reboot drew mixed reactions. Stock rose early, fell late, but ended positive."
      },
      {
        "year": 2016,
        "headline": "eSports & Streaming Boost Battlefield 1",
        "body": "Battlefield 1 thrived on Twitch/YouTube, and FIFA 17 moved to Frostbite with a story mode. EA launched official eSports events like the FIFA Interactive World Cup, driving positive stock performance."
      },
      {
        "year": 2017,
        "headline": "Battlefront II Controversy and Respawn Acquisition",
        "body": "Microtransaction backlash hit Star Wars Battlefront II; Mass Effect: Andromeda underperformed. EA acquired Respawn Entertainment for Apex Legends rights; FIFA 18’s Ultimate Team model generated solid revenue. Stock remained upward."
      },
      {
        "year": 2018,
        "headline": "FIFA Ultimate Team Monetization Steadies",
        "body": "EA expanded monetization in FIFA Ultimate Team. FIFA 19 held revenue, but delays in original IPs and few new hits triggered a late-year stock plunge after a modest first half."
      },
      {
        "year": 2019,
        "headline": "Apex Legends and Jedi: Fallen Order Triumph",
        "body": "Respawn’s Apex Legends became a breakout success; FIFA 20 and Jedi: Fallen Order performed strongly. EA emphasized player-friendly microtransactions, and stock ended positive. Scientists speculated a pandemic that might occur next year driving game demand to record highs. Sounds like a good time to buy."
      },
      {
        "year": 2020,
        "headline": "Pandemic-Driven Engagement and Subscription Growth",
        "body": "COVID-19 lockdowns boosted playtime and spending. FIFA 21 and Apex Legends hit new active-user highs; EA expanded subscription penetration via Xbox Game Pass, sending stock upward."
      },
      {
        "year": 2021,
        "headline": "FIFA Rebrand to EA Sports FC and Apex Stabilizes",
        "body": "Pandemic lifts faded, usage dipped, and EA announced the FIFA rebrand to EA Sports FC. FIFA 22 and Madden 22 remained strong despite “new-year fatigue,” while Apex retention slowed, leading to a negative stock finish."
      },
      {
        "year": 2022,
        "headline": "Split from FIFA and Need for Speed: Unbound Release",
        "body": "Inflation and tech layoffs dampened confidence. EA ended its FIFA partnership after 2022; FIFA 23 sold well, but Need for Speed: Unbound underperformed. Stock ended negative."
      },
      {
        "year": 2023,
        "headline": "Restructuring in Weak Economy & EA FC 24 Debut",
        "body": "EA restructured into EA Sports and EA Entertainment, cutting 6% of staff. EA Sports FC 24 launched to stable sales, Star Wars Jedi: Survivor earned praise, and Apex remained steady—stock finished positive."
      },
      {
        "year": 2024,
        "headline": "AI Trends and EA Sports FC 25 Release",
        "body": "Volatile markets and AI shifts defined 2024. EA Sports FC 25 released with slightly lower sales but remained the main revenue driver; Apex entered its live-service phase, in a cycle of high profits with fewer blockbusters."
      }
    ],
    "Nintendo": [
    {
      "year": 2002,
      "headline": "GBA Outperforms GameCube",
      "body": "With the global economic recovery, the gaming industry has entered a new round of console competition. Nintendo consolidated its leading position in the handheld console market through the promotion of GameCube and Game Boy Advance (GBA). \"Super Mario Sunshine\" and \"Metroid Prime\" enhanced the appeal of GameCube, but failed to meet expectations, while the GBA game \"Pokemon Ruby and Sapphire\" sold well. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2003,
      "headline": "Wind Waker Underwhelms as GBA Strengthens Sales",
      "body": "The global economy is recovering, and consumers' demand for entertainment products is rising. \"The Legend of Zelda: The Wind Waker\" performed well on GameCube but its sales growth was slow. The handheld console market continues to be driven by the launch of the Game Boy Advance SP and strong sales. Overall stock price performance (from the beginning of the year to the end of the year): stable, negative."
    },
    {
      "year": 2004,
      "headline": "Nintendo DS Ushers in Dual-Screen Era",
      "body": "The global economy is growing steadily, and technological innovation promotes the development of electronic products. The Nintendo DS was released, and sales were promoted and a good market response was achieved through innovative design and gaming experience. Works such as \"Metroid Prime 2: Echoes\" and \"Paper Mario: The Thousand-Year Door\" performed well when released. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    },
    {
      "year": 2005,
      "headline": "Wii Reveal Sparks Anticipation Amid DS Momentum",
      "body": "The continuous growth of the global economy and the rising demand for portable electronic products have driven up the sales of Nintendo DS, and have continued to boost sales through \"Nintendogs\" and \"Mario Kart DS\". On the other hand, GameCube declined, but it was not significantly affected. In the same year, the development plan for the next-generation console Wii was disclosed for the first time. The exposure of Wii attracted market attention and filled investors with confidence. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    },
    {
      "year": 2006,
      "headline": "Wii Launch Propels Motion-Control Craze",
      "body": "The global economy is stable and consumers have a strong interest in innovative entertainment products. The Wii console with motion-sensing control was officially released. The innovative design and gaming experience of Wii attracted a large number of new users. \"Wii Sports\" and \"The Legend of Zelda: Twilight Princess\" also further boosted the sales of Wii. Nintendo DS launched \"New Super Mario Bros.\" which continues to sell well. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    },
    {
      "year": 2007,
      "headline": "Wii & DS Sales Soar to Record Highs",
      "body": "The global economy continues to grow, and consumers have a strong demand for interactive entertainment products. The Nintendo DS launched \"Brain Age\" and \"Pokemon Diamond and Pearl\", which continued to boost the sales of the Nintendo DS. The release of \"Wii Fit\" and \"Super Mario Galaxy\" continues to boost Wii sales. The success of Wii and Nintendo DS has driven the company's performance to a new high. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive. However analysts report a global financial crisis so it might be a good time to sell."
    },
    {
      "year": 2008,
      "headline": "Nintendo Weathers 08' Crisis with Strong Titles",
      "body": "The global financial crisis broke out and consumer spending generally declined. \"Mario Kart Wii\" and \"Super Smash Bros. Brawl\" are still selling well. Nintendo DS has launched \"Professor Layton\" and \"Pokemon Platinum\". Although Wii and Nintendo DS launched new games and achieved good performance, due to the sluggish global economy, investors' confidence was generally low. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2009,
      "headline": "DSi Launch and New Titles Stimulate Handheld Market",
      "body": "The global economy is gradually recovering. Nintendo launched the Nintendo DSi and added new functions to stimulate demand. In order to continue promoting Wii and Nintendo DS, new games \"New Super Mario Bros. Wii\" and \"Wii Sports Resort\" were launched. Nintendo DS launched \"Pokemon HeartGold and SoulSilver\", but investors remained very cautious. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2010,
      "headline": "3DS Announcement Prepares Next-Gen Handheld",
      "body": "The global economic recovery is slow, consumer spending is still restricted, and market competition is intensifying. The announcement of the development of a new generation of handheld console, Nintendo 3DS, offers hope for future growth. \"Super Mario Galaxy 2\" and \"Donkey Kong Country Returns\" were released. Nintendo DS launched \"Pokemon Black and White\" and achieved good sales. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2011,
      "headline": "3DS Launch Struggles and Wii Sales Decline",
      "body": "The global economy continues to recover and smartphone games are emerging. The Nintendo 3DS and \"The Legend of Zelda: Ocarina of Time 3D\" and \"Super Mario 3D Land\" were released, but their sales fell short of expectations and the market response was lukewarm. Wii launched \"The Legend of Zelda: Skyward Sword\", but still couldn't prevent the decline in Wii sales. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2012,
      "headline": "Wii U Debut Falls Short, 3DS Remains Steady",
      "body": "The global economy is stable and the penetration rate of smart devices has increased. The Wii U was released and \"New Super Mario Bros. U\" and \"Nintendo Land\" were launched, but the market acceptance was low and the sales were poor. The 3DS released \"Animal Crossing: New Leaf\" and \"Fire Emblem Awakening\", which performed steadily but were difficult to make up for the losses brought by Wii U. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2013,
      "headline": "Digital Sales Strengthen",
      "body": "The global economy continues to grow and the mobile game market expands. The Wii U released \"Super Mario 3D World\" and \"Pikmin 3\", and the 3DS released \"Pokemon X and Y\" and \"The Legend of Zelda: A Link Between Worlds\", which performed steadily. Nintendo has transformed its business model and strengthened the sales of digital content. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    },
    {
      "year": 2014,
      "headline": "3DS Dominates Despite Wii U Struggles",
      "body": "The global economy is stable and smart devices continue to be popular. Wii U launched \"Mario Kart 8\" and \"Super Smash Bros. for Wii U\". The 3DS launched \"Super Smash Bros. for Nintendo 3DS\" and \"Pokemon Omega Ruby and Alpha Sapphire\". Although the sales of Wii U have remained sluggish, 3DS has performed stably and has become the main source of income for the company. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2015,
      "headline": "Amiibo Expands Revenue While Consoles Thrive",
      "body": "The global economy continues to grow and the mobile game market is booming. Nintendo announced its entry into the mobile game market, collaborating with DeNA to launch Amiibo. By leveraging the strong sales of Amiibo, it expanded its peripheral product line and revenue sources. On the other hand, Wii U released \"Splatoon\" and \"Super Mario Maker\", while 3DS released \"The Legend of Zelda: Majora's Mask 3D\" and \"Animal Crossing: Happy Home Designer\". Overall stock price performance (from the beginning of the year to the end of the year): rise followed by decline, positive."
    },
    {
      "year": 2016,
      "headline": "Pokémon GO Craze and Switch Teaser Energize Market",
      "body": "The global economy is growing steadily and the smartphone game market is expanding rapidly. The first mobile app \"Miitomo\" was released to test the waters. The collaboration with Niantic to launch \"Pokémon GO\" sparked a global craze and enhanced the brand's influence. It was announced that the new console \"NX\" (later named Switch) would be released in 2017. Wii U sales remained sluggish, while 3DS performance was stable. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive. This might be a good time to buy up shares."
    },
    {
      "year": 2017,
      "headline": "Switch Unites Home and Handheld Experiences",
      "body": "The global economy continues to grow, and consumers have a strong demand for innovative entertainment products. The Nintendo Switch was released in March, integrating home and handheld console functions. Its sales reached 17.79 million units, exceeding expectations. \"The Legend of Zelda: Breath of the Wild\" and \"Super Mario Odyssey\" were also great successes. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    },
    {
      "year": 2018,
      "headline": "Switch Online Fuels Digital Subscription Growth",
      "body": "The global economy is stable and digital entertainment consumption continues to grow. Nintendo launched the Switch Online service and entered the online subscription business. The cumulative sales of Switch exceeded 32 million units. \"Super Smash Bros. Ultimate\" and \"Pokemon: Let's Go, Pikachu!/Eevee!\" sold well. The continuous success of the Switch platform consolidated its market position. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2019,
      "headline": "Switch Lite Expands Portable Market Reach",
      "body": "The global economy continues to grow, and the demand for portable entertainment devices is rising. Nintendo released Switch Lite, focusing on portability to attract more users. \"Pokemon Sword and Shield\" and \"Luigi's Mansion 3\" sold well. Annual sales of Switch reached 21.1 million units, and cumulative sales exceeded 52 million units. Investors held a positive attitude. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive. Scientists have speculated a pandemic that might occur next year driving game demand to record highs. This might be a good time to buy shares."
    },
    {
      "year": 2020,
      "headline": "Pandemic Spurs Animal Crossing Phenomenon",
      "body": "The COVID-19 pandemic led to global home quarantine, causing a sharp increase in demand for games. \"Animal Crossing: New Horizons\" became a phenomenon-level game, with sales exceeding 30 million. Annual sales of Switch reached 28.83 million units, and cumulative sales exceeded 84 million units. Nintendo seized the opportunity to meet the surging market demand. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    },
    {
      "year": 2021,
      "headline": "OLED Model Launch Amid Slowing Growth",
      "body": "The global economy is gradually recovering, competition in the gaming market is intensifying, and Nintendo's growth is slowing down. Nintendo released the Switch OLED model to enhance the hardware experience. Games such as \"Metroid Dread\" and \"Pokemon Brilliant Diamond and Shining Pearl\" were released. Annual sales of Switch reached 23.06 million units, and cumulative sales exceeded 100 million units. However, due to market slowdown and intensified competition, performance declined slightly. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2022,
      "headline": "Supply Chain Challenges Amid Top-Selling Releases",
      "body": "The global semiconductor supply chain remained tight, restricting production, and inflation affected consumer spending. \"Pokemon Legends: Arceus\" launched an open-world experiment and sold over ten million copies. \"Splatoon 3\" continued series popularity, and \"Xenoblade Chronicles 3\" received excellent reviews. Investors were skeptical about future growth. Overall stock price performance (from the beginning of the year to the end of the year): declined, negative."
    },
    {
      "year": 2023,
      "headline": "IP Expansion and Box Office Hit Drive Switch Momentum",
      "body": "The global economy is recovering. Consumer spending is cautious, but entertainment remained strong. Amid AI trends, Nintendo strengthened cross-media IP expansion: \"The Super Mario Bros. Movie\" became a $1.3 billion global hit. \"The Legend of Zelda: Tears of the Kingdom\" was a huge success, and \"Super Mario RPG Remastered\" and \"Pikmin 4\" performed steadily. Cumulative Switch sales exceeded 130 million units. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    },
    {
      "year": 2024,
      "headline": "Next-Gen Hardware Tease and Multimedia Partnerships",
      "body": "The global tech industry entered the early stage of AI-hardware integration, raising user expectations. Nintendo confirmed development of \"next-generation hardware\" is nearly complete, without a release date. They renewed a cooperation agreement with Universal Pictures and plan more film and TV works. The Switch platform continues, with stable sales of \"Princess Peach: Showtime\" and \"Luigi's Mansion 2 HD\". Active eShop promotions and expanded merchandise, movies, and subscription lines support their revenue base. Investors expressed a positive attitude. Overall stock price performance (from the beginning of the year to the end of the year): upward, positive."
    }
  ]
    
  }
  